/* This is a generated file, do not modify. 이 파일은 자동 생성된 파일입니다. 수정하지 마십시오. */

import React, { memo, forwardRef } from 'react';

export const CalendarFilled16Icon = memo(
  forwardRef<SVGSVGElement>((props, ref) => (
    <svg
      ref={ref}
      width="16"
      height="16"
      viewBox="0 0 16 16"
      fill="current"
      xmlns="http://www.w3.org/2000/svg"
      {...props}
    >
      <path
        d="M3 3.66663V12.3333H13V3.66663H3ZM2 3.45639C2 3.0082 2.36913 2.66663 2.7973 2.66663H13.2027C13.6309 2.66663 14 3.0082 14 3.45639V12.5435C14 12.9917 13.6309 13.3333 13.2027 13.3333H2.7973C2.36913 13.3333 2 12.9917 2 12.5435V3.45639Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
      <path
        d="M6 1.33337C6.27614 1.33337 6.5 1.55723 6.5 1.83337V4.16671C6.5 4.44285 6.27614 4.66671 6 4.66671C5.72386 4.66671 5.5 4.44285 5.5 4.16671V1.83337C5.5 1.55723 5.72386 1.33337 6 1.33337Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
      <path
        d="M10 1.33337C10.2761 1.33337 10.5 1.55723 10.5 1.83337V4.16671C10.5 4.44285 10.2761 4.66671 10 4.66671C9.72386 4.66671 9.5 4.44285 9.5 4.16671V1.83337C9.5 1.55723 9.72386 1.33337 10 1.33337Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
      <path
        d="M2.7973 3.16663H13.2027C13.3669 3.16663 13.5 3.29636 13.5 3.45639V12.5435C13.5 12.7036 13.3669 12.8333 13.2027 12.8333H2.7973C2.6331 12.8333 2.5 12.7036 2.5 12.5435V3.45639C2.5 3.29636 2.6331 3.16663 2.7973 3.16663ZM5.66667 5.83329C5.39052 5.83329 5.16667 6.05715 5.16667 6.33329C5.16667 6.60944 5.39052 6.83329 5.66667 6.83329H10.3333C10.6095 6.83329 10.8333 6.60944 10.8333 6.33329C10.8333 6.05715 10.6095 5.83329 10.3333 5.83329H5.66667Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
    </svg>
  )),
);
