/* This is a generated file, do not modify. 이 파일은 자동 생성된 파일입니다. 수정하지 마십시오. */

import React, { memo, forwardRef } from 'react';

export const LockFilled20Icon = memo(
  forwardRef<SVGSVGElement>((props, ref) => (
    <svg
      ref={ref}
      width="20"
      height="20"
      viewBox="0 0 20 20"
      fill="current"
      xmlns="http://www.w3.org/2000/svg"
      {...props}
    >
      <g clipPath="url(#clip0_4006_4518)" xmlns="http://www.w3.org/2000/svg">
        <path d="M15.4165 9.22501V17.0833H4.58315V9.22501H15.4165ZM15.8332 7.97501H4.19149C3.97047 7.97501 3.75851 8.06281 3.60223 8.21909C3.44595 8.37537 3.35815 8.58733 3.35815 8.80834V17.5167C3.35815 17.7377 3.44595 17.9497 3.60223 18.1059C3.75851 18.2622 3.97047 18.35 4.19149 18.35H15.8582C16.0792 18.35 16.2911 18.2622 16.4474 18.1059C16.6037 17.9497 16.6915 17.7377 16.6915 17.5167V8.80001C16.6915 8.57899 16.6037 8.36703 16.4474 8.21075C16.2911 8.05447 16.0792 7.96667 15.8582 7.96667L15.8332 7.97501Z" />
        <path
          d="M10.0082 2.91663C7.94624 2.91663 6.0415 5.07866 6.0415 8.07496H4.7915C4.7915 4.67126 7.00343 1.66663 10.0082 1.66663C13.0129 1.66663 15.2248 4.67126 15.2248 8.07496H13.9748C13.9748 5.07866 12.0701 2.91663 10.0082 2.91663Z"
          fillRule="evenodd"
          clipRule="evenodd"
        />
        <path
          d="M15.8332 9.16663H4.1665V17.5H15.8332V9.16663ZM9.99984 15C10.9203 15 11.6665 14.2538 11.6665 13.3333C11.6665 12.4128 10.9203 11.6666 9.99984 11.6666C9.07936 11.6666 8.33317 12.4128 8.33317 13.3333C8.33317 14.2538 9.07936 15 9.99984 15Z"
          fillRule="evenodd"
          clipRule="evenodd"
        />
      </g>
      <defs xmlns="http://www.w3.org/2000/svg">
        <clipPath id="clip0_4006_4518">
          <rect width="13.3333" height="16.6667" fill="white" transform="translate(3.33325 1.66663)" />
        </clipPath>
      </defs>
    </svg>
  )),
);
