/* This is a generated file, do not modify. 이 파일은 자동 생성된 파일입니다. 수정하지 마십시오. */

import React, { memo, forwardRef } from 'react';

export const LockFilled16Icon = memo(
  forwardRef<SVGSVGElement>((props, ref) => (
    <svg
      ref={ref}
      width="16"
      height="16"
      viewBox="0 0 16 16"
      fill="current"
      xmlns="http://www.w3.org/2000/svg"
      {...props}
    >
      <g clipPath="url(#clip0_4003_4985)" xmlns="http://www.w3.org/2000/svg">
        <path d="M12.3334 7.38008V13.6667H3.66677V7.38008H12.3334ZM12.6668 6.38008H3.35343C3.17662 6.38008 3.00705 6.45032 2.88203 6.57534C2.75701 6.70037 2.68677 6.86994 2.68677 7.04675V14.0134C2.68677 14.1902 2.75701 14.3598 2.88203 14.4848C3.00705 14.6098 3.17662 14.6801 3.35343 14.6801H12.6868C12.8636 14.6801 13.0331 14.6098 13.1582 14.4848C13.2832 14.3598 13.3534 14.1902 13.3534 14.0134V7.04008C13.3534 6.86327 13.2832 6.6937 13.1582 6.56868C13.0331 6.44365 12.8636 6.37341 12.6868 6.37341L12.6668 6.38008Z" />
        <path
          d="M8.00683 2.33337C6.35729 2.33337 4.8335 4.063 4.8335 6.46004H3.8335C3.8335 3.73708 5.60304 1.33337 8.00683 1.33337C10.4106 1.33337 12.1802 3.73708 12.1802 6.46004H11.1802C11.1802 4.063 9.65637 2.33337 8.00683 2.33337Z"
          fillRule="evenodd"
          clipRule="evenodd"
        />
        <path
          d="M12.6668 7.33337H3.3335V14H12.6668V7.33337ZM8.00016 12C8.73654 12 9.3335 11.4031 9.3335 10.6667C9.3335 9.93033 8.73654 9.33337 8.00016 9.33337C7.26378 9.33337 6.66683 9.93033 6.66683 10.6667C6.66683 11.4031 7.26378 12 8.00016 12Z"
          fillRule="evenodd"
          clipRule="evenodd"
        />
      </g>
      <defs xmlns="http://www.w3.org/2000/svg">
        <clipPath id="clip0_4003_4985">
          <rect width="10.6667" height="13.3333" fill="white" transform="translate(2.66675 1.33337)" />
        </clipPath>
      </defs>
    </svg>
  )),
);
