/* This is a generated file, do not modify. 이 파일은 자동 생성된 파일입니다. 수정하지 마십시오. */

import React, { memo, forwardRef } from 'react'

export const PenLineIcon = memo(
  forwardRef<SVGSVGElement>((props, ref) => (
    <svg ref={ref} viewBox="0 0 24 24" fill="current" xmlns="http://www.w3.org/2000/svg" {...props}>
      <path
        d="M16.8716 3.28773C17.0533 3.10734 17.299 3.0061 17.555 3.0061C17.8111 3.0061 18.0567 3.10734 18.2384 3.28773L18.2393 3.28858L20.7223 5.76156C20.9026 5.94327 21.0039 6.18893 21.0039 6.44498C21.0039 6.70102 20.9027 6.94668 20.7223 7.12839L20.7203 7.13031L8.88453 18.9661L4.66124 20.8924L4.35001 20.21L4.63164 20.9051C4.41679 20.9921 4.18105 21.014 3.95385 20.9679C3.72666 20.9218 3.51808 20.8098 3.35416 20.6458C3.19024 20.4819 3.07823 20.2733 3.03212 20.0461C2.98601 19.8189 3.00785 19.5832 3.0949 19.3684L3.10123 19.3527L5.04442 15.1149L16.8697 3.28965L16.8716 3.28773ZM4.83845 19.1629L8.0155 17.7138L19.2836 6.44574L17.5558 4.72488L6.29561 15.985L4.83845 19.1629Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
      <path
        d="M6.23034 14.9796L9.02034 17.7696L7.95968 18.8303L5.16968 16.0403L6.23034 14.9796Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
      <path
        d="M16.4203 4.79968L19.2003 7.57968L18.1397 8.64034L15.3597 5.86034L16.4203 4.79968Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
    </svg>
  )),
)
