/* This is a generated file, do not modify. 이 파일은 자동 생성된 파일입니다. 수정하지 마십시오. */

import React, { memo, forwardRef } from 'react';

export const PersonLine48Icon = memo(
  forwardRef<SVGSVGElement>((props, ref) => (
    <svg
      ref={ref}
      width="48"
      height="48"
      viewBox="0 0 48 48"
      fill="current"
      xmlns="http://www.w3.org/2000/svg"
      {...props}
    >
      <path
        d="M24 9C21.6528 9 19.75 10.9028 19.75 13.25C19.75 15.5972 21.6528 17.5 24 17.5C26.3472 17.5 28.25 15.5972 28.25 13.25C28.25 10.9028 26.3472 9 24 9ZM16.75 13.25C16.75 9.24594 19.9959 6 24 6C28.0041 6 31.25 9.24594 31.25 13.25C31.25 17.2541 28.0041 20.5 24 20.5C19.9959 20.5 16.75 17.2541 16.75 13.25Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
      <path
        d="M6.00111 39.9383C6.37252 30.2792 14.2349 22.5 24 22.5C33.7545 22.5 41.7055 30.2709 41.9993 39.9504L42 39.9727L42 39.995C42.0003 40.5476 41.7702 41.0581 41.392 41.4243C41.0168 41.7874 40.525 41.9837 40.0261 41.9993L40.0027 42H7.99727L7.97388 41.9993C7.47496 41.9837 6.98315 41.7874 6.60802 41.4243C6.22982 41.0581 5.99967 40.5476 6 39.995L6.00002 39.9667L6.00111 39.9383ZM9.07549 39H38.9331C38.1773 31.427 31.7749 25.5 24 25.5C16.2385 25.5 9.88905 31.4145 9.07549 39Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
    </svg>
  )),
);
