/* This is a generated file, do not modify. 이 파일은 자동 생성된 파일입니다. 수정하지 마십시오. */

import React, { memo, forwardRef } from 'react';

export const TimecalendarLine48Icon = memo(
  forwardRef<SVGSVGElement>((props, ref) => (
    <svg
      ref={ref}
      width="48"
      height="48"
      viewBox="0 0 48 48"
      fill="current"
      xmlns="http://www.w3.org/2000/svg"
      {...props}
    >
      <path
        d="M33 25C29.6863 25 27 27.6863 27 31C27 34.3137 29.6863 37 33 37C36.3137 37 39 34.3137 39 31C39 27.6863 36.3137 25 33 25ZM24 31C24 26.0294 28.0294 22 33 22C37.9706 22 42 26.0294 42 31C42 35.9706 37.9706 40 33 40C28.0294 40 24 35.9706 24 31Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
      <path
        d="M33 27.17C33.7346 27.17 34.33 27.7655 34.33 28.5V30.17H35.4C36.1346 30.17 36.73 30.7655 36.73 31.5C36.73 32.2346 36.1346 32.83 35.4 32.83H33C32.2655 32.83 31.67 32.2346 31.67 31.5V28.5C31.67 27.7655 32.2655 27.17 33 27.17Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
      <path
        d="M9 11V37H22.2875C23.116 37 23.7875 37.6716 23.7875 38.5C23.7875 39.3284 23.116 40 22.2875 40H8.39189C7.7701 40 7.16599 39.7598 6.71454 39.32C6.26166 38.8789 6 38.2722 6 37.6312V10.3688C6 9.72783 6.26166 9.12112 6.71454 8.67997C7.166 8.24021 7.77012 8 8.39189 8H39.6223L39.6365 8.00027C40.2472 8.01182 40.8371 8.25313 41.2803 8.68489C41.7248 9.1178 41.9872 9.70969 41.9997 10.3389L42 10.3538V20.9679C42 21.7964 41.3284 22.4679 40.5 22.4679C39.6716 22.4679 39 21.7964 39 20.9679V11H9Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
      <path
        d="M18 4C18.8284 4 19.5 4.67157 19.5 5.5V12.5C19.5 13.3284 18.8284 14 18 14C17.1716 14 16.5 13.3284 16.5 12.5V5.5C16.5 4.67157 17.1716 4 18 4Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
      <path
        d="M30 4C30.8284 4 31.5 4.67157 31.5 5.5V12.5C31.5 13.3284 30.8284 14 30 14C29.1716 14 28.5 13.3284 28.5 12.5V5.5C28.5 4.67157 29.1716 4 30 4Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
      <path
        d="M15.5 19C15.5 18.1716 16.1716 17.5 17 17.5H31C31.8284 17.5 32.5 18.1716 32.5 19C32.5 19.8284 31.8284 20.5 31 20.5H17C16.1716 20.5 15.5 19.8284 15.5 19Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
    </svg>
  )),
);
