/* This is a generated file, do not modify. 이 파일은 자동 생성된 파일입니다. 수정하지 마십시오. */

import React, { memo, forwardRef } from 'react';

export const TrashcanFilled48Icon = memo(
  forwardRef<SVGSVGElement>((props, ref) => (
    <svg
      ref={ref}
      width="48"
      height="48"
      viewBox="0 0 48 48"
      fill="current"
      xmlns="http://www.w3.org/2000/svg"
      {...props}
    >
      <g clipPath="url(#clip0_4006_4950)" xmlns="http://www.w3.org/2000/svg">
        <path
          d="M12.75 5.5C12.75 4.67157 13.4216 4 14.25 4H33.75C34.5784 4 35.25 4.67157 35.25 5.5C35.25 6.32843 34.5784 7 33.75 7H14.25C13.4216 7 12.75 6.32843 12.75 5.5Z"
          fillRule="evenodd"
          clipRule="evenodd"
        />
        <path
          d="M8 11.5C8 10.6716 8.67157 10 9.5 10H38.5C39.3284 10 40 10.6716 40 11.5C40 12.3284 39.3284 13 38.5 13H9.5C8.67157 13 8 12.3284 8 11.5Z"
          fillRule="evenodd"
          clipRule="evenodd"
        />
        <path
          d="M13 10C13.8284 10 14.5 10.6716 14.5 11.5V41H33.5V11.5C33.5 10.6716 34.1716 10 35 10C35.8284 10 36.5 10.6716 36.5 11.5V41.9452C36.5 41.9455 36.5 41.9449 36.5 41.9452C36.5001 42.4331 36.3301 42.9271 35.9898 43.3171C35.6453 43.712 35.143 43.9764 34.5758 43.9988L34.5462 44H13.4537L13.4241 43.9988C12.8569 43.9764 12.3547 43.712 12.0102 43.3171C11.6696 42.9268 11.4999 42.4336 11.5 41.9461C11.5 41.946 11.5 41.9462 11.5 41.9461V11.5C11.5 10.6716 12.1716 10 13 10Z"
          fillRule="evenodd"
          clipRule="evenodd"
        />
        <path
          d="M35 41.9461V11.5H13V41.9461C12.9999 42.0896 13.0502 42.2276 13.1404 42.3309C13.2306 42.4343 13.3535 42.4949 13.4833 42.5H34.5166C34.6464 42.4949 34.7694 42.4343 34.8595 42.3309C34.9497 42.2276 35.0001 42.0896 35 41.9461ZM25.5 18.1001C25.5 17.2717 24.8284 16.6001 24 16.6001C23.1716 16.6001 22.5 17.2717 22.5 18.1001V35.9653C22.5 36.7938 23.1716 37.4653 24 37.4653C24.8284 37.4653 25.5 36.7938 25.5 35.9653V18.1001Z"
          fillRule="evenodd"
          clipRule="evenodd"
        />
      </g>
      <defs xmlns="http://www.w3.org/2000/svg">
        <clipPath id="clip0_4006_4950">
          <rect width="32" height="40" fill="white" transform="translate(8 4)" />
        </clipPath>
      </defs>
    </svg>
  )),
);
